app/Controllers/c_mahasiswa.php

SELECT *
FROM `mahasiswa`
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `mahasiswa`
---
    public function display(){

        $pager = \Config\Services::pager();
        $request = \Config\Services::request();

        $input = $this->request->getVar('cari');
        if ($input){
            $data['mahasiswa'] = $this->mahasiswa->cariNama($input);
        } else {
            $data['mahasiswa'] = $this->mahasiswa->paginate(3, 'mahasiswa');